---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetCalculatedDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition)
source: html/4f9b2836-c05d-0b69-2329-d844f3e7bcbe.htm
---
# Autodesk.Revit.DB.FabricationPart.GetCalculatedDimensionValue Method

Gets the calculated dimension value.

## Syntax (C#)
```csharp
public string GetCalculatedDimensionValue(
	FabricationDimensionDefinition dim
)
```

## Parameters
- **dim** (`Autodesk.Revit.DB.FabricationDimensionDefinition`) - The fabrication dimension.

## Returns
The calculated dimension value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null